export const languageMapping = [
    'eng',
    'rus'
];

export const languages = [
    [
        [['`', '~'], ['1', '!'], ['2', '@'], ['3', '#'], ['4', '$'], ['5', '%'], ['6', '^'], ['7', '&'], ['8', '*'], ['9', '('], ['0', ')'], ['-', '_'], ['=', '+'], 'Backspace'],
        [null].concat('qwertyuiop'.split(''), [['[', '{'], [']', ['}']], ['\\', '|']]),
        ['CapsLock'].concat('asdfghjkl'.split(''), [[';', ':'], ['\'', '"']]),
        ['Shift'].concat('zxcvbnm'.split(''), [[',', '<'], ['.', '>'], ['/', '?']]),
        ['Lang', 'Space', 'Enter']
    ],
    [
        ['ё', ['1', '!'], ['2', '"'], ['3', '№'], ['4', ';'], ['5', '%'], ['6', ':'], ['7', '?'], ['8', '*'], ['9', '('], ['0', ')'], ['-', '_'], ['=', '+'], 'Backspace'],
        [null].concat('йцукенгшщзхъ'.split(''), [['\\', '/']]),
        ['CapsLock'].concat('фывапролджэ'.split('')),
        ['Shift'].concat('ячсмитьбю'.split(''), [['.', ',']]),
        ['Lang', 'Space', 'Enter']
    ]
];
